completing stage 3 of the documentation migration
